
# Introdução ao SQL

Aprendemos neste módulo que temos diversos softwares e interfaces que podemos utilizar durante o dia para executarmos códigos em SQL, assim como o Python.
Utilizaremos o próprio ambiente do Jupyter Notebook para construirmos nossas Querys (Consultas) de dados com SQL.

In [ ]:
import sqlite3 #Importando a biblioteca necessária
import pandas as pd

In [ ]:
df_funcionarios = pd.read_csv("SQL_TB_FUNCIONARIOS.csv", delimiter=';')

In [ ]:
# Criar uma conexão com um banco de dados SQLite em memória
conn = sqlite3.connect(':memory:')
# Carregar o DataFrame no banco de dados SQLite
df_funcionarios.to_sql('tb_funcionarios', conn, index=False, if_exists='replace')

10

In [ ]:
# Função para executar consultas SQL e retornar o resultado como um DataFrame
def run_query(query):
    return pd.read_sql_query(query, conn)

In [ ]:
query = "SELECT * FROM tb_funcionarios"
result_df = run_query(query)
# Exibir o resultado
print(result_df)

    ID       ÁREA   CARGO  SALÁRIO  TEMPO_NA_EMPRESA
0  136         TI  JUNIOR     2500                 0
1  125         TI  SENIOR     6000                 1
2  148         TI  SENIOR     6000                 2
3  456        ADM   PLENO     4500                 2
4  345        ADM   PLENO     4600                 4
5  254        ADM  SENIOR     5600                 5
6  178        ADM  JUNIOR     2200                 0
7  365  MARKETING  JUNIOR     2300                 1
8  145  MARKETING  SENIOR     5500                 3
9  258  MARKETING   PLENO     4600                 2

In [ ]:
query = "SELECT ID FROM tb_funcionarios"
result_df = run_query(query)
print(result_df)

    ID
0  136
1  125
2  148
3  456
4  345
5  254
6  178
7  365
8  145
9  258

No SQL, a cláusula LIMIT é usada para restringir o número de linhas retornadas por uma consulta. É particularmente útil quando você deseja visualizar apenas uma parte dos dados, como um número específico de registros.

In [ ]:
query = "SELECT ID FROM tb_funcionarios limit 5"
result_df = run_query(query)
print(result_df)

    ID
0  136
1  125
2  148
3  456
4  345

In [ ]:
query = "SELECT ID,  CARGO FROM TB_FUNCIONARIOS"
result_df = run_query(query)
print(result_df)

    ID   CARGO
0  136  JUNIOR
1  125  SENIOR
2  148  SENIOR
3  456   PLENO
4  345   PLENO
5  254  SENIOR
6  178  JUNIOR
7  365  JUNIOR
8  145  SENIOR
9  258   PLENO

# **MÓDULO 24 - AULA 4**
# Operações matemáticas

In [ ]:
query = "SELECT AVG(SALÁRIO) FROM TB_FUNCIONARIOS"
result_df = run_query(query)
print(result_df)

   AVG(SALÁRIO)
0        4380.0

In [ ]:
query = "SELECT SUM(SALÁRIO) FROM TB_FUNCIONARIOS"
result_df = run_query(query)
print(result_df)

   SUM(SALÁRIO)
0         43800

Para alterar o nome de uma coluna em uma consulta SQL, você pode usar a cláusula AS. Isso permite que você renomeie colunas no resultado da consulta sem alterar os nomes das colunas na tabela original.

In [ ]:
query = "SELECT SUM(SALÁRIO) AS SOMA_SALÁRIO FROM TB_FUNCIONARIOS"
result_df = run_query(query)
print(result_df)

   SOMA_SALÁRIO
0         43800